Revit 2027 API
PerformanceAdviser.GetNumberOfRules Method
 Retrieves number of performance adviser rules in the list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfRules()
Public Function GetNumberOfRules As Integer
public:
int GetNumberOfRules()
member GetNumberOfRules : unit -> int
Return Value
Int32
 Number of performance adviser rules in the list.
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace